app/controllers/api/events_controller.rb

SELECT "events".* FROM "events" ORDER BY event_date desc
---
    def index
      respond_with Event.order("#{sort_by} #{order}")

SELECT "events".* FROM "events" WHERE (name LIKE '%E%' OR place LIKE '%E%' OR description LIKE '%E%')
---
    def search
      query = params[:query]
      events = Event.where('name Like ? OR place LIKE ? OR description LIKE ?', "%#{query}%", "%#{query}%", "%#{query}%")

INSERT INTO "events" ("name", "description", "place", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Prabu"], ["description", "Eternal Desc 01"], ["place", "Maja"], ["created_at", "2017-07-13 07:11:25.164798"], ["updated_at", "2017-07-13 07:11:25.164798"]]
---
    def create
      event = Event.new(event_params)
      if event.save

UPDATE "events" SET "event_date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["event_date", "2020-10-10"], ["updated_at", "2017-07-13 07:13:28.885286"], ["id", 11]]
---
    def update
      if @event.update(event_params)